; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=180, out_folder=./training, instance_id=20, seed=2044, goal_proportion=0.03

(define (problem blocksworld-20)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 - object)
 (:init 
    (arm-empty)
    (clear b53)
    (on b53 b126)
    (on b126 b8)
    (on b8 b10)
    (on-table b10)
    (clear b111)
    (on-table b111)
    (clear b70)
    (on-table b70)
    (clear b142)
    (on b142 b151)
    (on-table b151)
    (clear b12)
    (on b12 b108)
    (on-table b108)
    (clear b176)
    (on b176 b105)
    (on b105 b4)
    (on b4 b27)
    (on b27 b170)
    (on b170 b36)
    (on b36 b144)
    (on-table b144)
    (clear b50)
    (on-table b50)
    (clear b71)
    (on-table b71)
    (clear b146)
    (on b146 b81)
    (on b81 b155)
    (on b155 b162)
    (on b162 b179)
    (on b179 b37)
    (on b37 b121)
    (on b121 b56)
    (on b56 b95)
    (on b95 b124)
    (on b124 b110)
    (on b110 b175)
    (on b175 b42)
    (on b42 b153)
    (on b153 b160)
    (on b160 b60)
    (on b60 b38)
    (on-table b38)
    (clear b98)
    (on b98 b85)
    (on b85 b35)
    (on b35 b131)
    (on b131 b57)
    (on b57 b79)
    (on b79 b163)
    (on b163 b62)
    (on-table b62)
    (clear b40)
    (on-table b40)
    (clear b114)
    (on b114 b136)
    (on-table b136)
    (clear b130)
    (on b130 b99)
    (on b99 b165)
    (on-table b165)
    (clear b46)
    (on b46 b20)
    (on-table b20)
    (clear b82)
    (on-table b82)
    (clear b139)
    (on-table b139)
    (clear b97)
    (on b97 b106)
    (on b106 b115)
    (on b115 b90)
    (on b90 b125)
    (on b125 b33)
    (on b33 b77)
    (on-table b77)
    (clear b76)
    (on b76 b34)
    (on b34 b72)
    (on b72 b9)
    (on b9 b172)
    (on b172 b54)
    (on b54 b180)
    (on b180 b173)
    (on b173 b51)
    (on b51 b78)
    (on b78 b178)
    (on b178 b14)
    (on b14 b154)
    (on b154 b18)
    (on b18 b93)
    (on b93 b148)
    (on b148 b152)
    (on b152 b58)
    (on-table b58)
    (clear b23)
    (on-table b23)
    (clear b117)
    (on b117 b140)
    (on b140 b30)
    (on-table b30)
    (clear b74)
    (on b74 b52)
    (on b52 b41)
    (on b41 b75)
    (on b75 b22)
    (on-table b22)
    (clear b61)
    (on b61 b122)
    (on b122 b103)
    (on-table b103)
    (clear b45)
    (on-table b45)
    (clear b88)
    (on-table b88)
    (clear b43)
    (on b43 b147)
    (on b147 b159)
    (on b159 b141)
    (on-table b141)
    (clear b48)
    (on-table b48)
    (clear b86)
    (on-table b86)
    (clear b92)
    (on-table b92)
    (clear b39)
    (on b39 b164)
    (on b164 b120)
    (on b120 b7)
    (on-table b7)
    (clear b73)
    (on b73 b109)
    (on b109 b84)
    (on b84 b91)
    (on b91 b44)
    (on-table b44)
    (clear b133)
    (on-table b133)
    (clear b63)
    (on-table b63)
    (clear b59)
    (on b59 b138)
    (on b138 b66)
    (on b66 b55)
    (on-table b55)
    (clear b112)
    (on b112 b150)
    (on-table b150)
    (clear b11)
    (on b11 b101)
    (on b101 b2)
    (on-table b2)
    (clear b107)
    (on b107 b68)
    (on b68 b6)
    (on-table b6)
    (clear b25)
    (on-table b25)
    (clear b143)
    (on b143 b132)
    (on-table b132)
    (clear b24)
    (on b24 b47)
    (on b47 b156)
    (on b156 b116)
    (on b116 b168)
    (on b168 b167)
    (on-table b167)
    (clear b19)
    (on-table b19)
    (clear b26)
    (on b26 b29)
    (on b29 b149)
    (on b149 b21)
    (on-table b21)
    (clear b5)
    (on b5 b87)
    (on b87 b171)
    (on b171 b1)
    (on b1 b69)
    (on b69 b174)
    (on b174 b94)
    (on-table b94)
    (clear b161)
    (on-table b161)
    (clear b89)
    (on-table b89)
    (clear b169)
    (on-table b169)
    (clear b16)
    (on b16 b127)
    (on b127 b177)
    (on-table b177)
    (clear b15)
    (on b15 b96)
    (on b96 b157)
    (on b157 b3)
    (on b3 b100)
    (on b100 b64)
    (on-table b64)
    (clear b65)
    (on b65 b113)
    (on-table b113)
    (clear b158)
    (on-table b158)
    (clear b123)
    (on b123 b80)
    (on b80 b118)
    (on b118 b166)
    (on b166 b145)
    (on-table b145)
    (clear b137)
    (on b137 b49)
    (on b49 b104)
    (on-table b104)
    (clear b119)
    (on-table b119)
    (clear b129)
    (on b129 b17)
    (on-table b17)
    (clear b102)
    (on b102 b31)
    (on b31 b13)
    (on b13 b135)
    (on b135 b128)
    (on b128 b67)
    (on b67 b134)
    (on-table b134)
    (clear b28)
    (on b28 b83)
    (on-table b83)
    (clear b32)
    (on-table b32))
 (:goal  (and 
    (clear b3)
    (on b3 b5)
    (on b5 b1)
    (on-table b1)
    (clear b4)
    (on b4 b2)
    (on-table b2))))

; plan
1. (unstack b11 b101)
   deleted: (on b11 b101) (clear b11) (arm-empty)
   added: (holding b11) (clear b101)
   goals met: 1 of 7
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 7
3. (unstack b101 b2)
   deleted: (on b101 b2) (clear b101) (arm-empty)
   added: (holding b101) (clear b2)
   goals met: 1 of 7
4. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 1 of 7
5. (unstack b15 b96)
   deleted: (on b15 b96) (clear b15) (arm-empty)
   added: (holding b15) (clear b96)
   goals met: 1 of 7
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 7
7. (unstack b176 b105)
   deleted: (on b176 b105) (clear b176) (arm-empty)
   added: (holding b176) (clear b105)
   goals met: 1 of 7
8. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 1 of 7
9. (unstack b105 b4)
   deleted: (on b105 b4) (clear b105) (arm-empty)
   added: (holding b105) (clear b4)
   goals met: 2 of 7
10. (putdown b105)
   deleted: (holding b105)
   added: (clear b105) (arm-empty) (on-table b105)
   goals met: 2 of 7
11. (unstack b96 b157)
   deleted: (on b96 b157) (clear b96) (arm-empty)
   added: (holding b96) (clear b157)
   goals met: 2 of 7
12. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 2 of 7
13. (unstack b157 b3)
   deleted: (on b157 b3) (clear b157) (arm-empty)
   added: (holding b157) (clear b3)
   goals met: 3 of 7
14. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 3 of 7
15. (unstack b3 b100)
   deleted: (on b3 b100) (clear b3) (arm-empty)
   added: (holding b3) (clear b100)
   goals met: 2 of 7
16. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 4 of 7
17. (unstack b4 b27)
   deleted: (on b4 b27) (clear b4) (arm-empty)
   added: (holding b4) (clear b27)
   goals met: 3 of 7
18. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 5 of 7
19. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 3 of 7
20. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 7
21. (unstack b5 b87)
   deleted: (on b5 b87) (clear b5) (arm-empty)
   added: (holding b5) (clear b87)
   goals met: 4 of 7
22. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 7
23. (unstack b87 b171)
   deleted: (on b87 b171) (clear b87) (arm-empty)
   added: (holding b87) (clear b171)
   goals met: 4 of 7
24. (putdown b87)
   deleted: (holding b87)
   added: (clear b87) (arm-empty) (on-table b87)
   goals met: 4 of 7
25. (unstack b171 b1)
   deleted: (on b171 b1) (clear b171) (arm-empty)
   added: (holding b171) (clear b1)
   goals met: 4 of 7
26. (putdown b171)
   deleted: (holding b171)
   added: (clear b171) (arm-empty) (on-table b171)
   goals met: 4 of 7
27. (unstack b1 b69)
   deleted: (on b1 b69) (clear b1) (arm-empty)
   added: (holding b1) (clear b69)
   goals met: 4 of 7
28. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 7
29. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 7
30. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 6 of 7
31. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 7
32. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 7 of 7
